# -*- coding: utf-8 -*-
"""
Created on Fri Jan 23 11:25:01 2026

@author: user
"""
# =============================================================================
# 
# name='金城武'
# price=400
# goods='衣服'
# # =============================================================================
# # output=(name,"花了",price,"買了一件",goods,sep='')
# # =============================================================================
# 
# print(f'{name}花了{price}買了一件{goods}')
# =============================================================================
# =============================================================================
# myStr="Python"
# print(myStr[::-1])
# =============================================================================
# =============================================================================
# celsius = float(input('請輸入現在的攝氏溫度'))
# fahrenheit = celsius*1.8+32
# print('華氏溫度為',celsius,'*1.8+32=',fahrenheit,sep='')
# =============================================================================
# =============================================================================
# money = input('輸入你的本金')
# money = int(money)
# interest = 0.015
# year1 = money*(1+interest)
# year2 = year1*(1+interest)
# year3 = year2*(1+interest)
# year3 = int(year3)
# print(f'你的第三年複利為{year3}')
# 
# 2**3=8
# 
# =============================================================================
# =============================================================================
# money = input('輸入你的本金(元)')
# money = int(money)
# years = input('輸入你需要的年數(年)')
# years = int(years)
# interest = 0.015
# total = money * (1+interest) ** years
# total = int(total)
# print(f'你的第{years}年複利為{total}元')
# 
# =============================================================================
backpack = ['水壺','小刀','過期罐頭','手電筒',]
print('初始背包',backpack)
backpack.append('散彈槍')
print('拿到武器後',backpack)
backpack.insert(0, '解毒劑')
print('緊急放入解毒劑',backpack)
backpack.remove('過期罐頭')
print('吃掉食物後',backpack)
backpack.sort(key=len)
print('整理背包後',backpack)
if '散彈槍' in backpack:
    print('劇情結果：砰！殭屍被轟飛了，你活下來了！')
else:
    print('劇情結果：你變成了殭屍的午餐...')
myStr=backpack
print('最終輕量化背包:',myStr[0:3:1])
